{
    "projects": {
        "graphics": {
            "id": 1,
            "title":"Graphics",
            "subtitle":"A collection of various graphic illustrations.",
            "theme":"#463857",
            "name":"graphics",
            "images": {
                "thumb":"trois.png",
                "collection": [
                    {
                        "fileName" : "trois.png",
                        "description" : "Here is a description for image trois.png"
                    }
                ]
            }
        },
        "rise-and-shine": {
            "id": 2,
            "title":"Rise & Shine",
            "subtitle":"An alarm clock app that won't stop until you smile in to the camera.",
            "theme":"#623E38",
            "name":"rise-and-shine",
            "images": {
                "thumb":"riseAndShine.png",
                "collection" : [
                    {
                        "fileName" : "riseAndShine-hero.png",
                        "description" : "Designing this app was a ton of fun. It's concept is unque and beneficial to those who have a hard time waking up happy. Studies show that being forced to smile in the morning makes your day much better. I made that up."
                    },
                    {
                        "fileName" : "riseAndShine-1.png",
                        "description" : "Main screen. Easily select which days the alarm will repeat and quickly access app settings as well as your not-so-glamorous morning photos."
                    },
                    {
                        "fileName" : "riseAndShine-2.png",
                        "description" : "Set your phone to strobe, vibrate, play audio, or all of the above! Clicking the trash button removes the alarm altogether."
                    },
                    {
                        "fileName" : "riseAndShine-5.png",
                        "description" : "Although this feature was never implemented, I designed a modal where the user could record custom alarm sounds."
                    },
                    {
                        "fileName" : "riseAndShine-3.png",
                        "description" : "We save each smiling mug you used to stop the alarm. A pull-down action reveals your bed-head photos. You can view and edit or opt out of saving each photo."
                    },
                    {
                        "fileName" : "riseAndShine-4.png",
                        "description" : "Save each photo to your phone or share via social media."
                    },
                    {
                        "fileName" : "riseAndShine-6.png",
                        "description" : "When it's time to wake up, the front facing camera is automatically activated and detects your smile. After smiling for 12 consecutive seconds, the moon goes away and the sun congratulates you for waking up!"
                    }
                ]
            }
        },
        "flyleaf" : {
            "id": 3,
            "title":"Flyleaf",
            "subtitle":"A service aimed at distributing paper copies of short stories from emerging authors.",
            "theme":"#111111",
            "name":"flyleaf",
            "images": {
                "thumb":"flyleaf-thumb.png",
                "collection": [
                    {
                        "fileName" : "flyleaf-hero.png",
                        "description" : "My initial task was to create a logo and color scheme for Flyleaf which later evolved in to designing, coding, and launching their website."
                    },
                    {
                        "fileName" : "flyleaf-notebook.png",
                        "description" : "Initial sketching phase."
                    },
                    {
                        "fileName" : "flyleaf-logos.png",
                        "description" : "I picked a handful of concepts and drew with them in Adobe Illustrator. These were the three logos I pitched."
                    },
                    {
                        "fileName" : "flyleaf-1-story.png",
                        "description" : "At this point in my career, I had yet to utilize the power of templating or databases. After teaching myself some PHP and how to incorporate a SQL database, I was able to quickly create a small yet scaleable site."
                    },
                    {
                        "fileName" : "flyleaf-2-about.png",
                        "description" : "New members were frequently added to the team. With a database and a template file, I was able to efficiently add members in seconds instead of hard-coding a new page for each new entry."
                    },
                    {
                        "fileName" : "flyleaf-3-submit.png",
                        "description" : "Subscription page."
                    },
                    {
                        "fileName" : "flyleaf-4-contact.png",
                        "description" : "Contact page. Each page was 100% mobile friendly; responsive with retina-display graphics."
                    }
                ]
            }
        },
        "mu-optics" : {
            "id": 4,
            "title":"Mu Optics",
            "subtitle":"Thermal imaging at consumer friendly prices.",
            "theme":"#580061",
            "name":"mu-optics",
            "images": {
                "thumb":"mu-thumb.png",
                "collection": [
                    {
                        "fileName" : "mu.png",
                        "description" : "Mu Optics set out to build an affordable thermal imaging device that interfaced with your smartphone or laptop. I was hired to create Mu Optic's brand and design their website and mobile app."
                    },
                    {
                        "fileName" : "mu-logos-notebook.png",
                        "description" : "Sketching phase."
                    },
                    {
                        "fileName" : "mu-logos.png",
                        "description" : "A small selection of logos that made it to the final round."
                    },
                    {
                        "fileName" : "muOptics-1.png",
                        "description" : "This layout that allows for quick access to all features and important settings. Easily adjust the viewing mode on the lefthand side. Change the infrared gradient by clicking on the thermal range indicator at the bottom of the screen. Switch infrared capture mode from photo to video at the bottom right. Initiate capture with the big red button."
                    },
                    {
                        "fileName" : "muOptics-2.png",
                        "description" : "When in Crosshair mode, you can pinpoint a section of the live infrared feed to receive a temperature reading."
                    },
                    {
                        "fileName" : "muOptics-3.png",
                        "description" : "Projects view."
                    },
                    {
                        "fileName" : "muOptics-4.png",
                        "description" : "Edit mode. Here you can select one or more projects and export or delete them."
                    },
                    {
                        "fileName" : "muOptics-5.png",
                        "description" : "Photos listed in a project. Each item contains the original photo as well as the infrared image so they can be easily compared after the thermal image is captured."
                    },
                    {
                        "fileName" : "muOptics-6.png",
                        "description" : "Edit mode for infrared photos and videos."
                    },
                    {
                        "fileName" : "muOptics-web-1.png",
                        "description" : "Mu Optic's website."
                    },
                    {
                        "fileName" : "muOptics-web-2.png",
                        "description" : "Initial website concept."
                    }
                ]
            }
        },
        "scrybe" : {
            "id": 5,
            "title":"Scrybe",
            "subtitle":"A simple app for translating text to various languages",
            "theme":"#464646",
            "name":"scrybe",
            "images": {
                "thumb":"scrybe.png",
                "collection": [
                    {
                        "fileName" : "scrybe-hero.png",
                        "description" : ""
                    },
                    {
                        "fileName" : "scrybe-1.png",
                        "description" : "A simple concept called for a simple interface. This was my first attempt at flat design inspired by iOS7's newly introduced design principles."
                    },
                    {
                        "fileName" : "scrybe-2.png",
                        "description" : "Clicking on the top right menu reveals saved translations ready to be played or edited."
                    },
                    {
                        "fileName" : "scrybe-3.png",
                        "description" : ""
                    }
                ]
            }
        },
        "sqipp" : {
            "id": 6,
            "title":"Sqipp",
            "subtitle":"A mobile app designed to allow a quick ordering experience for pickup.",
            "theme":"#B3291A",
            "name":"sqipp",
            "images": {
                "thumb":"sqipp-thumb.png",
                "collection": [
                    {
                        "fileName" : "sqipp-thumb.png",
                        "description" : ""
                    },
                    {
                        "fileName" : "sqipp-logos.png",
                        "description" : "Different logo considerations. Quality ranging from 'acceptable' to 'just awful'"
                    },
                    {
                        "fileName" : "sqipp-1.png",
                        "description" : "Log in screen for native iOS app."
                    },
                    {
                        "fileName" : "sqipp-2.jpg",
                        "description" : " At this pont in time, iPhones had not expanded past the 640x960 screen size. Arranging and consolidating as much information and features while retaining a readable and useful view proved to be quite a challenge."
                    },
                    {
                        "fileName" : "sqipp-3.png",
                        "description" : "View more information about a restaurant by selecting the hamburger menu to the right of the name. View restaurant hours or get directions. Addiontally, you can add to favorites or call the restaurant."
                    },
                    {
                        "fileName" : "sqipp-4.jpg",
                        "description" : "View of the full menu. The bottom bar found on most screens allows for quick access to account settings, current order and total, and your favorites list."
                    },
                    {
                        "fileName" : "sqipp-5.jpg",
                        "description" : "Choose additional options and view pricing for extras."
                    },
                    {
                        "fileName" : "sqipp-6.jpg",
                        "description" : "Account page. Update your account name and email, modify payment methods, and view previous orders."
                    },
                    {
                        "fileName" : "sqipp-ipad.png",
                        "description" : "I also designed an iPad app for vendors to use. Here they would receive orders from the Sqipp iPhone app and process them accordingly."
                    }
                ]
            }
        }
    }
}